cfg/Catalogs/ВнешниеОбработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ВнешниеОбработки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХранилищеВнешнейОбработки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДополнительныхВнешнихОбработок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийКФайлуИсточнику</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Принадлежность</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПредставлениеОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаОбъекта</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТабличнаяЧастьИмя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТабличнаяЧастьПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НастройкиПостроителяДляОтбора</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеВнешнейОбработки</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаменяемаяПечатнаяФорма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВнешниеОбработки</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайлаПечатнойФормы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеОтбораПостроителя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеКнопки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительныеПараметрыОбработки</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеНастроекОбработки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfg/Enums/ВидыДополнительныхВнешнихОбработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыДополнительныхВнешнихОбработок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПечатнаяФорма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполнениеТабличныхЧастей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
					<Comment>Внешний отчет</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/Catalogs/ВнешниеОбработки/Forms/ФормаЭлемента/Ext/Form/Module.bsl
Перем мСпискиПечатныхФормОбъектов;

Перем мТекущаяСтрока, мПредыдущийВидОбработки;

Процедура ДействияФормыРедактироватьКод(Кнопка)
	МеханизмНумерацииОбъектов.ИзменениеВозможностиРедактированияНомера(ЭтотОбъект.Метаданные(), ЭтаФорма, ЭлементыФормы.ДействияФормы.Кнопки.Подменю, ЭлементыФормы.Код);
КонецПроцедуры
Процедура ОткрытьФормуВыбораПринадлежности(Элемент, СсылкаОбъекта = Неопределено, РежимПодбора = Ложь)

	Отказ = Истина;
	Форма = ПолучитьФорму("ФормаВыбораПринадлежности", Элемент);
	Форма.РежимВыбора = Истина;
	Форма.РежимПодбора = РежимПодбора;
	
	Если Не ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.ПечатнаяФорма Тогда
		Форма.УжеВыбранные = СтуктураЗаполненных(СсылкаОбъекта);
	КонецЕсли; 
	мТекущаяСтрока = ?(СсылкаОбъекта = Неопределено, Неопределено, Элемент.ТекущаяСтрока);
	Если Форма.Открыта() Тогда
		Форма.СписокДокументов.Очистить();
	КонецЕсли;
	Форма.Открыть();
	
КонецПроцедуры

Процедура ПринадлежностьПередНачаломДобавления(Элемент, Отказ, Копирование)
	
	Отказ = Истина;
	ОткрытьФормуВыбораПринадлежности(Элемент);
	
КонецПроцедуры

Процедура ПринадлежностьОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗНЧ(ВыбранноеЗначение) <> Тип("СписокЗначений") Тогда
		
		Если мТекущаяСтрока = Неопределено Тогда
			НоваяСтрока = Принадлежность.Добавить();
		Иначе
			НоваяСтрока = мТекущаяСтрока;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗНЧ(ВыбранноеЗначение) = Тип("ЭлементСпискаЗначений") Тогда // Выбрали ТЧ
		
		НоваяСтрока.ТабличнаяЧастьИмя           = ВыбранноеЗначение.Значение;
		НоваяСтрока.ТабличнаяЧастьПредставление = ВыбранноеЗначение.Представление;
		
	ИначеЕсли ТипЗНЧ(ВыбранноеЗначение) = Тип("СписокЗначений") Тогда
		
		Для Каждого Объект Из ВыбранноеЗначение Цикл
			
			НоваяСтрока = Принадлежность.Добавить();
			
			
			Если Метаданные.Документы.Содержит(Объект.Значение) Тогда
				
				НоваяСтрока.СсылкаОбъекта = Документы[Объект.Значение.Имя].ПустаяСсылка();
				НоваяСтрока.ПредставлениеОбъекта = "Документ """ + ?(Объект.Значение.Синоним = "", Объект.Значение.Имя, Объект.Значение.Синоним)+"""";
				
			ИначеЕсли Метаданные.Справочники.Содержит(Объект.Значение) Тогда
				
				НоваяСтрока.СсылкаОбъекта = Справочники[Объект.Значение.Имя].ПустаяСсылка();
				НоваяСтрока.ПредставлениеОбъекта = "Справочник """ + ?(Объект.Значение.Синоним = "", Объект.Значение.Имя, Объект.Значение.Синоним)+"""";
				
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("ОбъектМетаданных") Тогда
		
		Если Метаданные.Документы.Содержит(ВыбранноеЗначение) Тогда
			НоваяСтрока.СсылкаОбъекта = Документы[ВыбранноеЗначение.Имя].ПустаяСсылка();
			НоваяСтрока.ПредставлениеОбъекта = "Документ """ + ?(ВыбранноеЗначение.Синоним="", ВыбранноеЗначение.Имя, ВыбранноеЗначение.Синоним)+"""";
		ИначеЕсли Метаданные.Справочники.Содержит(ВыбранноеЗначение) Тогда
			НоваяСтрока.СсылкаОбъекта = Справочники[ВыбранноеЗначение.Имя].ПустаяСсылка();
			НоваяСтрока.ПредставлениеОбъекта = "Справочник """ + ?(ВыбранноеЗначение.Синоним="", ВыбранноеЗначение.Имя, ВыбранноеЗначение.Синоним)+"""";
		КонецЕсли;
		
		ЗаполнитьСписокВыбораПодменяемыхФорм();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСписокВыбораПодменяемыхФорм()
	
	ЭлементыФормы.Принадлежность.Колонки.ЗаменяемаяПечатнаяФорма.ЭлементУправления.СписокВыбора.Очистить();
	Если ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.ПечатнаяФорма Тогда
		
		Если ЭлементыФормы.Принадлежность.ТекущаяСтрока <> Неопределено Тогда
			ЭлементыФормы.Принадлежность.Колонки.ЗаменяемаяПечатнаяФорма.ЭлементУправления.СписокВыбора = ПолучитьСписокПечатныхФормОбъектов(ЭлементыФормы.Принадлежность.ТекущиеДанные.СсылкаОбъекта);
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

Функция СтуктураЗаполненных(ТекущийОбъект = Неопределено)
	
	Результат = Новый Соответствие;
	Если ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.ЗаполнениеТабличныхЧастей Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого СтрокаПринадлежности ИЗ Принадлежность Цикл
		
		Если ТекущийОбъект = Неопределено Тогда
			Результат.Вставить(СтрокаПринадлежности.СсылкаОбъекта.Метаданные(), Истина);
		ИначеЕсли ТекущийОбъект <> Неопределено И СтрокаПринадлежности.СсылкаОбъекта <> ТекущийОбъект Тогда
			Результат.Вставить(СтрокаПринадлежности.СсылкаОбъекта.Метаданные(), Истина);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ПередЗаписью(Отказ)	
	
	Если ВидОбработки.Пустая() Тогда
		Предупреждение(НСтр("ru='Не заполнено поле: Вид обработки';uk='Не заповнене поле: Вид обробки'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
	
	Если Не ВыбраныФайлыВнешнейОбработки() Тогда
		Предупреждение(НСтр("ru='Не выбран файл внешней обработки';uk='Не обраний файл зовнішньої обробки'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Функция ВыбратьФайл()
	
	
	Если ВидОбработки.Пустая() Тогда
		Предупреждение(НСтр("ru='Не заполнено значение реквизита ""Вид обработки""';uk='Не заповнене значення реквізиту ""Вид обробки""'"));
		Возврат Неопределено;
	КонецЕсли; 
	
	ДиалогФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	Если ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.Отчет Тогда
		
		ДиалогФайла.Фильтр = "Внешний отчет(*.erf)|*.erf";
		
	Иначе
		
		ДиалогФайла.Фильтр = "Внешняя обработка(*.epf)|*.epf";
		
	КонецЕсли;

	
	ВнешняяОбработка = Неопределено;

	ЕСли ДиалогФайла.Выбрать() Тогда
		ПолноеИмяФайлаОбработки = ДиалогФайла.ПолноеИмяФайла;
		
		Попытка
			
			Если ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.Отчет Тогда
				
				СообщениеОшибки = НСтр("ru='Выбранный файл не является внешним отчетом."
"Либо, данный отчет не предназначена для"
"запуска в этой конфигурации.';uk='Обраний файл не є зовнішнім звітом."
"Або, даний звіт не призначений для"
"запуску в цій конфігурації.'");
				
				ВнешняяОбработка = ВнешниеОтчеты.Создать(ПолноеИмяФайлаОбработки);
				
			Иначе
				
				СообщениеОшибки = НСтр("ru='Выбранный файл не является внешней обработкой."
"Либо, данная обработка не предназначена для"
"запуска в этой конфигурации.';uk='Обраний файл не є зовнішньою обробкою."
"Або, дана обробка не призначена для"
"запуску в цій конфігурації.'");
				
				ВнешняяОбработка = ВнешниеОбработки.Создать(ПолноеИмяФайлаОбработки);
				
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Наименование) Тогда
				Наименование = ВнешняяОбработка.Метаданные().Синоним;
			КонецЕсли;
			
		Исключение
			
			Сообщить(ОписаниеОшибки());
			Предупреждение(СообщениеОшибки);
			
			ПолноеИмяФайлаОбработки = "";
			
			Возврат Неопределено;
			
		КонецПопытки;

		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Файл = Новый Файл(ДиалогФайла.ПолноеИмяФайла);
	
	КомментарийКФайлу = Файл.Имя + Символы.ПС + "размер:" + Файл.Размер()+" байт; изменен:" + Файл.ПолучитьВремяИзменения() + "; сохранен в ИБ:" + ТекущаяДата();
	
	СтруктураВозврата = Новый Структура("КомментарийКФайлу,ПолноеИмяФайлаОбработки,ИмяФайлаОбработки,ВнешняяОбработка", КомментарийКФайлу, ПолноеИмяФайлаОбработки, Файл.Имя, ВнешняяОбработка);
	
	ЭлементыФормы.ВидОбработки.ТолькоПросмотр = Истина;
	
	Возврат СтруктураВозврата;
	
КонецФункции // ВыбратьФайл()

Процедура КоманднаяПанельФайлаИсточникаЗаменитьФайл(Элемент)
	
	ЗначениеВозврата = ВыбратьФайл();
	Если ЗначениеВозврата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяФайлаВнешнейОбработки   = ЗначениеВозврата.ПолноеИмяФайлаОбработки;
	
	Если ЗначениеВозврата.ВнешняяОбработка.Метаданные().Макеты.Найти("Параметры_Авторегистрации")<>Неопределено Тогда
		Макет = ЗначениеВозврата.ВнешняяОбработка.ПолучитьМакет("Параметры_Авторегистрации");
		ТаблицаПринадлежности = Новый ТаблицаЗначений;
		ТаблицаПринадлежности.Колонки.Добавить("СсылкаОбъекта");
		ТаблицаПринадлежности.Колонки.Добавить("ТабличнаяЧастьИмя");
		Для индекс = 1 по Макет.ВысотаТаблицы Цикл
			Попытка
				ВидОбъектаСтр = Макет.Область(индекс, 1, индекс, 1).Текст;
				ИмяТЧ         = ?(ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.ЗаполнениеТабличныхЧастей,Макет.Область(индекс, 2, индекс, 2).Текст,"");
				ЕСли Лев(ВидОбъектаСтр, Найти(ВидОбъектаСтр, ".")-1) = "Документы" Тогда
					Попытка
						СсылкаНаОбъект = Документы[Сред(ВидОбъектаСтр, Найти(ВидОбъектаСтр, ".")+1)].ПустаяСсылка();
						СтрокаТаблицыПринадлежности = ТаблицаПринадлежности.Добавить();
						СтрокаТаблицыПринадлежности.СсылкаОбъекта     = СсылкаНаОбъект;
						СтрокаТаблицыПринадлежности.ТабличнаяЧастьИмя = ИмяТЧ;
					Исключение
					КонецПопытки;
				ИначеЕсли Лев(ВидОбъектаСтр, Найти(ВидОбъектаСтр, ".")-1)  = "Справочники" Тогда
					Попытка
						СсылкаНаОбъект = Справочники[Сред(ВидОбъектаСтр, Найти(ВидОбъектаСтр, ".")+1)].ПустаяСсылка();
						СтрокаТаблицыПринадлежности = ТаблицаПринадлежности.Добавить();
						СтрокаТаблицыПринадлежности.СсылкаОбъекта     = СсылкаНаОбъект;
						СтрокаТаблицыПринадлежности.ТабличнаяЧастьИмя = ИмяТЧ;
					Исключение
					КонецПопытки;
				КонецЕсли;
			Исключение
			КонецПопытки;
		КонецЦикла;
		Если ТаблицаПринадлежности.Количество() > 0 Тогда
			Ответ = Вопрос(НСтр("ru='Указанная внешняя печатная форма содержит параметры авторегистрации. Использовать их при регистрации?';uk='Вказана зовнішня друкована форма містить параметри автореєстрації. Використовувати їх при реєстрації?'"), РежимДиалогаВопрос.ДаНет);
			Если Ответ = КодВозвратаДиалога.Да Тогда
				Для Каждого СтрокаТаблицыПринадлежности Из ТаблицаПринадлежности Цикл
					Если Принадлежность.НайтиСтроки(Новый Структура("СсылкаОбъекта,ТабличнаяЧастьИмя", СтрокаТаблицыПринадлежности.СсылкаОбъекта, СтрокаТаблицыПринадлежности.ТабличнаяЧастьИмя)).Количество() = 0 Тогда
						НоваяСтрока = Принадлежность.Добавить();
						НоваяСтрока.СсылкаОбъекта = СтрокаТаблицыПринадлежности.СсылкаОбъекта;
						МетаданныеОбъекта = СтрокаТаблицыПринадлежности.СсылкаОбъекта.Метаданные();
						Если Метаданные.Документы.Содержит(МетаданныеОбъекта) Тогда
							НоваяСтрока.ПредставлениеОбъекта = "Документ """ + ?(МетаданныеОбъекта.Синоним = "", МетаданныеОбъекта.Имя, МетаданныеОбъекта.Синоним) + """";
						ИначеЕсли Метаданные.Справочники.Содержит(МетаданныеОбъекта) Тогда
							НоваяСтрока.ПредставлениеОбъекта = "Справочник """ + ?(МетаданныеОбъекта.Синоним = "", МетаданныеОбъекта.Имя, МетаданныеОбъекта.Синоним) + """";
						КонецЕсли;
						НоваяСтрока.ТабличнаяЧастьИмя = СтрокаТаблицыПринадлежности.ТабличнаяЧастьИмя;
						НайденнаяТЧ = МетаданныеОбъекта.ТабличныеЧасти.Найти(СтрокаТаблицыПринадлежности.ТабличнаяЧастьИмя);
						Если НайденнаяТЧ = Неопределено Тогда
							НоваяСтрока.ТабличнаяЧастьПредставление = НоваяСтрока.ТабличнаяЧастьИмя;
						Иначе
							НоваяСтрока.ТабличнаяЧастьПредставление = НайденнаяТЧ.Синоним;
						КонецЕсли; 
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕСли;
	ХранилищеВнешнейОбработки = Новый ХранилищеЗначения(Новый ДвоичныеДанные(ИмяФайлаВнешнейОбработки));
	
	
	КомментарийКФайлуИсточнику = "Исходный файл: " + ЗначениеВозврата.КомментарийКФайлу;
	
	ЭлементыФормы.КомментарийКФайлуИсточнику.ЦветТекста = ЦветаСтиля.ЦветТекстаФормы;
	
КонецПроцедуры

Процедура ПриОткрытии()	
	
	ДанныеХранилища = ХранилищеВнешнейОбработки.Получить();
	
	Если Не ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.ПечатнаяФорма и ДанныеХранилища = Неопределено Тогда
		
		КомментарийКФайлуИсточнику = "Файл внешней обработки не выбран";

	КонецЕсли;
	
	ЭлементыФормы.ВидОбработки.ТолькоПросмотр = Не ВидОбработки.Пустая();
	
	мПредыдущийВидОбработки = ВидОбработки;
	ОбновитьДоступностьПринадлежности();
	
	МеханизмНумерацииОбъектов.ДобавитьВМенюДействияКнопкуРедактированияКода(ЭлементыФормы.ДействияФормы.Кнопки.Подменю);
	МеханизмНумерацииОбъектов.УстановитьДоступностьПоляВводаНомера(Метаданные(), ЭтаФорма, ЭлементыФормы.ДействияФормы.Кнопки.Подменю,ЭлементыФормы.Код);
КонецПроцедуры

Процедура ОбновитьДоступностьПринадлежности()
	
	Если ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.ПечатнаяФорма Тогда
		Заголовок = НСтр("ru='Регистрация внешней печатной формы';uk='Реєстрація зовнішньої друкованої форми'");
	ИначеЕсли ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.ЗаполнениеТабличныхЧастей Тогда
		Заголовок = НСтр("ru='Регистрация внешней обработки заполнения табличных частей';uk='Реєстрація зовнішньої обробки заповнення табличних частин'");
	ИначеЕсли ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.Обработка Тогда
		Заголовок = НСтр("ru='Регистрация внешней обработки';uk='Реєстрація зовнішньої обробки'");
	ИначеЕсли ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.Отчет Тогда
		Заголовок = НСтр("ru='Регистрация внешнего отчета';uk='Реєстрація зовнішнього звіту'");
	КонецЕсли;
	
	Если ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.Обработка ИЛИ ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.Отчет ИЛИ ВидОбработки.Пустая() Тогда
		Если Не Принадлежность.Количество() = 0  Тогда
			Принадлежность.Очистить();
		КонецЕсли;
		
		ЭлементыФормы.Панель.Страницы.СтраницаПринадлежность.Доступность = Ложь;
		ЭлементыФормы.РамкаГруппыПринадлежность.Видимость = Ложь;
	Иначе
		ЭлементыФормы.Панель.Страницы.СтраницаПринадлежность.Доступность = Истина;
		ЭлементыФормы.РамкаГруппыПринадлежность.Видимость = Истина;
		Если ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.ПечатнаяФорма Тогда
			ЭлементыФормы.РамкаГруппыПринадлежность.Заголовок = НСтр("ru='Принадлежность печатной формы';uk='Приналежність друкованої форми'");
		Иначе
			ЭлементыФормы.РамкаГруппыПринадлежность.Заголовок = НСтр("ru='Принадлежность обработки по заполнению табличных частей';uk='Приналежність обробки по заповненню табличних частин'");
		КонецЕсли; 
	КонецЕсли;
	
	ЭлементыФормы.Принадлежность.Колонки.ТабличнаяЧасть.Видимость                 = (ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.ЗаполнениеТабличныхЧастей);
	
	ЭтоВидОбработкиПечатнойФормы = ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.ПечатнаяФорма;
	ЭтоВидОбработкиЗаполнениеТЧ  = ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.ЗаполнениеТабличныхЧастей;
	
	ЭлементыФормы.Принадлежность.Колонки.ПредставлениеКнопки.Видимость            = ЭтоВидОбработкиЗаполнениеТЧ;
	ЭлементыФормы.Принадлежность.Колонки.ПредставлениеОтбораПостроителя.Видимость = ЭтоВидОбработкиПечатнойФормы;
	ЭлементыФормы.Принадлежность.Колонки.ЗаменяемаяПечатнаяФорма.Видимость        = ЭтоВидОбработкиПечатнойФормы;
	ЭлементыФормы.Принадлежность.Колонки.ИмяФайлаПечатнойФормы.Видимость          = ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.ПечатнаяФорма;
	
КонецПроцедуры // () 

Процедура ВидОбработкиПриИзменении(Элемент)
	
	Если Не Принадлежность.Количество() = 0 Тогда
		Если (ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.Обработка) ИЛИ ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.Отчет Тогда
			Если Вопрос(НСтр("ru='Табличная часть будет очищена';uk='Таблична частина буде очищена'"), РежимДиалогаВопрос.ОКОтмена) = КодВозвратаДиалога.Отмена Тогда
				ВидОбработки =  мПредыдущийВидОбработки;
				Возврат;
			КонецЕсли;
		ИначеЕсли (ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.ПечатнаяФорма)И мПредыдущийВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.ЗаполнениеТабличныхЧастей Тогда
			Если Вопрос(НСтр("ru='Данные о табличных частях будут утеряны';uk='Дані про табличні частини будуть втрачені'"), РежимДиалогаВопрос.ОКОтмена) = КодВозвратаДиалога.Отмена Тогда
				ВидОбработки =  мПредыдущийВидОбработки;
				Возврат;
			Иначе
				Принадлежность.Свернуть("ПредставлениеОбъекта,СсылкаОбъекта",);
			КонецЕсли;
		КонецЕсли; 
	КонецЕсли;
	
	ОбновитьДоступностьПринадлежности();
	
КонецПроцедуры

Процедура ПринадлежностьПредставлениеОбъектаНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	ОткрытьФормуВыбораПринадлежности(ЭлементыФормы.Принадлежность, ЭлементыФормы.Принадлежность.ТекущиеДанные.СсылкаОбъекта);
	
КонецПроцедуры

Функция СтуктураЗаполненныхТЧ(ТекущиеДанные)
	Массив = Принадлежность.НайтиСтроки(Новый Структура("СсылкаОбъекта",ТекущиеДанные.СсылкаОбъекта));
	Результат = Новый Соответствие;
	Для Каждого СтрокаПринадлежности ИЗ Массив Цикл
		Если Не СтрокаПринадлежности = ТекущиеДанные Тогда
			Результат.Вставить(СтрокаПринадлежности.ТабличнаяЧастьИмя, Истина);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

Процедура ПринадлежностьТабличнаяЧастьНачалоВыбора(Элемент, СтандартнаяОбработка)
	ТекущиеДанные = ЭлементыФормы.Принадлежность.ТекущиеДанные;
	Форма = ПолучитьФорму("ФормаВыбораТЧПринадлежности", ЭлементыФормы.Принадлежность);
	Форма.РежимВыбора = Истина;
	Если  ТекущиеДанные.СсылкаОбъекта  = Неопределено Тогда
		Предупреждение(НСтр("ru='Не выбрана принадлежность к объекту';uk=""Не обрана приналежність до об'єкта"""));
		Возврат;
	КонецЕсли; 
	Форма.СсылкаОбъекта = ТекущиеДанные.СсылкаОбъекта;
	Форма.УжеВыбранные  = СтуктураЗаполненныхТЧ(ТекущиеДанные);
	мТекущаяСтрока = ЭлементыФормы.Принадлежность.ТекущаяСтрока;
	Если Форма.Открыта() Тогда
		Форма.СписокТабличныхЧастей.Очистить();
	КонецЕсли;
	Форма.Открыть();
КонецПроцедуры

Процедура КоманднаяПанельФайлаИсточникаСохранитьФайлНаДиск(Элемент)
	
	ДиалогФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Если ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.Отчет Тогда
		
		ДиалогФайла.Фильтр = "Внешний отчет(*.erf)|*.erf";
		
	Иначе
		ДиалогФайла.Фильтр = "Внешняя обработка(*.epf)|*.epf";
	КонецЕсли;
	ДвоичныеДанные = ХранилищеВнешнейОбработки.Получить();
	Если ДвоичныеДанные = Неопределено Тогда
		Предупреждение(НСтр("ru='Внешний файл отсутствует в хранилище';uk='Зовнішній файл відсутній у сховище'")); 
		Возврат;
	КонецЕсли; 
	
	ДиалогФайла.ПолноеИмяФайла = РаботаСФайлами.УдалитьЗапрещенныеСимволыИмени(Наименование);
	Если ДиалогФайла.Выбрать() Тогда
		ИмяФайла = ДиалогФайла.ПолноеИмяФайла;
		Попытка
			ДвоичныеДанные.Записать(ИмяФайла);
		Исключение
			Предупреждение(НСтр("ru='Внешний файл не сохранен"
"';uk='Зовнішній файл не збережений"
"'")+ОписаниеОшибки()); 
		КонецПопытки; 
	КонецЕсли;
КонецПроцедуры

Процедура РедактироватьДополнительныеУсловия()

	Если ЭлементыФормы.Принадлежность.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ЭлементыФормы.Принадлежность.ТекущиеДанные.СсылкаОбъекта)) Тогда
		МетаданныеОбъекта = ЭлементыФормы.Принадлежность.ТекущиеДанные.СсылкаОбъекта.Метаданные();
		ИмяТаблицы     = "Документ." + МетаданныеОбъекта.Имя;
		СинонимТаблицы = МетаданныеОбъекта.Синоним;
	ИначеЕсли Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(ЭлементыФормы.Принадлежность.ТекущиеДанные.СсылкаОбъекта)) Тогда
		МетаданныеОбъекта = ЭлементыФормы.Принадлежность.ТекущиеДанные.СсылкаОбъекта.Метаданные();
		ИмяТаблицы     = "Справочник." + МетаданныеОбъекта.Имя;
		СинонимТаблицы = МетаданныеОбъекта.Синоним;
	Иначе
		Сообщить(НСтр("ru='Указан неверный тип объекта в текущей строке или объект не выбран!';uk=""Вказано невірний тип об'єкта в поточному рядку або об'єкт не обрано!"""));
		Возврат;
	КонецЕсли;
	
	ПостроительОтчета = УниверсальныеМеханизмы.ИнициализироватьПостроительДопПечатныхФорм(ИмяТаблицы, СинонимТаблицы);
	
	ЗначениеХранилища = ЭлементыФормы.Принадлежность.ТекущиеДанные.НастройкиПостроителяДляОтбора.Получить();
	Если ТипЗнч(ЗначениеХранилища) = Тип("НастройкиПостроителяОтчета") Тогда
		ПостроительОтчета.УстановитьНастройки(ЗначениеХранилища, Истина, Ложь, Ложь, Ложь, Ложь);
	КонецЕсли;
	
	ФормаНастройки = ПолучитьФорму("ФормаНастройкиПостроителя");
	ФормаНастройки.Построитель = ПостроительОтчета;
	ЗначениеВозврата = ФормаНастройки.ОткрытьМодально();
	
	Если ЗначениеВозврата <> Неопределено Тогда
		Если ТипЗнч(ЗначениеВозврата) = Тип("ПостроительОтчета") Тогда
			ЭлементыФормы.Принадлежность.ТекущиеДанные.НастройкиПостроителяДляОтбора = Новый ХранилищеЗначения(ЗначениеВозврата.ПолучитьНастройки(Истина, Ложь, Ложь, Ложь, Ложь));
			ЭлементыФормы.Принадлежность.ТекущиеДанные.ПредставлениеОтбораПостроителя = Строка(ЗначениеВозврата.Отбор);
		Иначе
			ЭлементыФормы.Принадлежность.ТекущиеДанные.НастройкиПостроителяДляОтбора = Новый ХранилищеЗначения(Неопределено);
			ЭлементыФормы.Принадлежность.ТекущиеДанные.ПредставлениеОтбораПостроителя = "";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПринадлежностьИмяФайлаПечатнойФормыНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЗначениеВозврата = ВыбратьФайл();
	
	Если ЗначениеВозврата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элемент.Значение = ЗначениеВозврата.КомментарийКФайлу;
	ЭлементыФормы.Принадлежность.ТекущиеДанные.ХранилищеВнешнейОбработки = Новый ХранилищеЗначения(Новый ДвоичныеДанные(ЗначениеВозврата.ПолноеИмяФайлаОбработки));
	
КонецПроцедуры

Процедура ПринадлежностьИмяФайлаПечатнойФормыОчистка(Элемент, СтандартнаяОбработка)
	
	ЭлементыФормы.Принадлежность.ТекущиеДанные.ХранилищеВнешнейОбработки = Новый ХранилищеЗначения(Неопределено);
	
КонецПроцедуры

Процедура ПринадлежностьПредставлениеОтбораПостроителяНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	РедактироватьДополнительныеУсловия();
	
КонецПроцедуры

Процедура ПринадлежностьПредставлениеОтбораПостроителяОчистка(Элемент, СтандартнаяОбработка)
	
	ЭлементыФормы.Принадлежность.ТекущиеДанные.НастройкиПостроителяДляОтбора = Новый ХранилищеЗначения(Неопределено);
	
КонецПроцедуры

Процедура ПринадлежностьПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ЗаполнитьСписокВыбораПодменяемыхФорм();
	
КонецПроцедуры

Процедура ПринадлежностьПриПолученииДанных(Элемент, ОформленияСтрок)
	
	Для каждого Оформление Из ОформленияСтрок Цикл
		
		Если Оформление.ДанныеСтроки.СсылкаОбъекта <> Неопределено И (ВидОбработки = Перечисления.ВидыДополнительныхВнешнихОбработок.ПечатнаяФорма) Тогда
			СписокВыбора = ПолучитьСписокПечатныхФормОбъектов(Оформление.ДанныеСтроки.СсылкаОбъекта);
			НайденныйЭлемент = СписокВыбора.НайтиПоЗначению(Оформление.ДанныеСтроки.ЗаменяемаяПечатнаяФорма);
			Если НайденныйЭлемент <> Неопределено Тогда
				Оформление.Ячейки.ЗаменяемаяПечатнаяФорма.УстановитьТекст(НайденныйЭлемент.Представление);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСписокПечатныхФормОбъектов(ОбъектСсылка)

	СписокФорм = мСпискиПечатныхФормОбъектов.Получить(ОбъектСсылка);
	
	Если ТипЗнч(СписокФорм) = Тип("СписокЗначений") Тогда
		Возврат СписокФорм.Скопировать();
	Иначе
		СписокФорм = Новый СписокЗначений;
	КонецЕсли;
	
	Объект = Неопределено;
	
	Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ОбъектСсылка)) Тогда
		Объект = Документы[ОбъектСсылка.Метаданные().Имя].СоздатьДокумент();
	ИначеЕсли Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(ОбъектСсылка)) Тогда
		Объект = Справочники[ОбъектСсылка.Метаданные().Имя].СоздатьЭлемент();
	КонецЕсли; 
	
	Если Объект <> Неопределено Тогда
		
		Попытка
			
			СтруктураПечатныхФорм = Объект.ПолучитьСтруктуруПечатныхФорм();
			
		Исключение
			
			Возврат СписокФорм;
			
		КонецПопытки;
		
		Если ТипЗНЧ(СтруктураПечатныхФорм) = Тип("Структура") Тогда
			
			Для каждого КлючИЗначение Из СтруктураПечатныхФорм Цикл
				СписокФорм.Добавить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
			КонецЦикла;
			
		КонецЕсли;
		
		мСпискиПечатныхФормОбъектов.Вставить(ОбъектСсылка, СписокФорм);
		
	КонецЕсли;
	
	Возврат СписокФорм;
	
КонецФункции // ()

Процедура КоманднаяПанельФайлаИсточникаУдалитьФайл(Кнопка)
	
	ХранилищеВнешнейОбработки = Новый ХранилищеЗначения(Неопределено);
	КомментарийКФайлуИсточнику = "Файл внешней обработки не выбран";
	
КонецПроцедуры

Процедура ОбновлениеОтображения()
	
	Если ВыбраныФайлыВнешнейОбработки() Тогда
		ЭлементыФормы.КомментарийКФайлуИсточнику.ЦветТекста = ЦветаСтиля.ЦветТекстаФормы;
	Иначе
		ЭлементыФормы.КомментарийКФайлуИсточнику.ЦветТекста = ЦветаСтиля.ТекстПредупреждающейНадписи;
	КонецЕсли; 
	
	
КонецПроцедуры

Функция ВыбраныФайлыВнешнейОбработки()

	Если КомментарийКФайлуИсточнику = "Файл внешней обработки не выбран" Тогда
		Если Принадлежность.Количество() = 0 или Не Принадлежность.Найти("","ИмяФайлаПечатнойФормы") = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли; 
	КонецЕсли;
	Возврат Истина;

КонецФункции // ()

Процедура КоманднаяПанельФормыПрава(Кнопка)
	
	Если НЕ РаботаСДиалогами.ЗаписатьНовыйОбъектВФорме(ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаПравДоступа.РедактироватьПраваДоступа(Ссылка);
	
КонецПроцедуры

Процедура ПринадлежностьПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Не ОтменаРедактирования Тогда
		ЭлементыФормы.ВидОбработки.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура КоманднаяПанельОбъектовЗаменитьФайл(Кнопка)
	
	ТекущиеДанные = ЭлементыФормы.Принадлежность.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ЗначениеВозврата = ВыбратьФайл();
	
	Если ЗначениеВозврата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.ИмяФайлаПечатнойФормы = ЗначениеВозврата.КомментарийКФайлу;
	ХранилищеВнешнейОбработки = Новый ХранилищеЗначения(Новый ДвоичныеДанные(ЗначениеВозврата.ПолноеИмяФайлаОбработки));
	
КонецПроцедуры

Процедура КоманднаяПанельОбъектовСохранитьФайлНаДиск(Кнопка)
	
	ТекущиеДанные = ЭлементыФормы.Принадлежность.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ДиалогФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогФайла.Фильтр = "Внешняя обработка(*.epf)|*.epf";
	ДвоичныеДанные = ТекущиеДанные.ХранилищеВнешнейОбработки.Получить();
	Если ДвоичныеДанные = Неопределено Тогда
		Предупреждение(НСтр("ru='Внешний файл отсутствует в хранилище';uk='Зовнішній файл відсутній у сховище'")); 
		Возврат;
	КонецЕсли; 
	
	ДиалогФайла.ПолноеИмяФайла = РаботаСФайлами.УдалитьЗапрещенныеСимволыИмени(Наименование);
	Если ДиалогФайла.Выбрать() Тогда
		ИмяФайла = ДиалогФайла.ПолноеИмяФайла;
		Попытка
			ДвоичныеДанные.Записать(ИмяФайла);
		Исключение
			Предупреждение(НСтр("ru='Внешний файл не сохранен"
"';uk='Зовнішній файл не збережений"
"'")+ОписаниеОшибки()); 
		КонецПопытки; 
	КонецЕсли;
	
КонецПроцедуры

Процедура ПринадлежностьТабличнаяЧастьОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = ЭлементыФормы.Принадлежность.ТекущиеДанные;
	ТекущиеДанные.ТабличнаяЧастьИмя           = "";
	ТекущиеДанные.ТабличнаяЧастьПредставление = "";
	
	
КонецПроцедуры

// Процедура обработки события "ПриВыводеСтроки" элемента формы Принадлежность.
// Устанавливает значение в поле ПредставлениеНастроекОбработки.
//
Процедура ПринадлежностьПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	
	Если ПустаяСтрока(ДанныеСтроки.ПредставлениеНастроекОбработки) Тогда
		
		ДополнительныеПараметрыОбработки = ДанныеСтроки.ДополнительныеПараметрыОбработки;
		
		Если ДополнительныеПараметрыОбработки.Получить() = Неопределено Тогда
			ДанныеСтроки.ПредставлениеНастроекОбработки = "<Задать параметры>";
		Иначе
			ДанныеСтроки.ПредставлениеНастроекОбработки = "<Изменить параметры>";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПринадлежностьПриВыводеСтроки()

// Процедура обработки события "НачалоВыбора" колонки ПредставлениеНастроекОбработки элемента формы Принадлежность.
// Открывает форму редактирования параметров обработки.
// Устанавливает значение в поле ПредставлениеНастроекОбработки.
//
Процедура ПринадлежностьПредставлениеНастроекОбработкиНачалоВыбора(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// Если новый объект, записать перед установкой параметров
	Если ЭтоНовый() Тогда
		
		Ответ = Вопрос(НСтр("ru='Перед установкой параметров необходимо записать объект. Записать?';uk=""Перед встановленням параметрів необхідно записати об'єкт. Записати?"""), РежимДиалогаВопрос.ДаНет);
		
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
		
		Если НЕ ЭтаФорма.ЗаписатьВФорме() Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ТекущиеДанные = ЭлементыФормы.Принадлежность.ТекущиеДанные;
	
	// Получить форму редактирования параметров
	ФормаПараметров = Ссылка.ПолучитьФорму("ФормаПараметровОбработки");
	
	// Передать параметры форме
	ФормаПараметров.ХранилищеПараметрыОбработки = ТекущиеДанные.ДополнительныеПараметрыОбработки;
	
	// Получить измененные параметры
	Параметры = ФормаПараметров.ОткрытьМодально();
	
	// Если параметры изменились, принять изменения
	Если Параметры <> Неопределено Тогда
		
		Если Параметры.Получить().Количество() > 0 Тогда
			ТекущиеДанные.ДополнительныеПараметрыОбработки = Параметры;
			ТекущиеДанные.ПредставлениеНастроекОбработки   = "<Изменить параметры>";
		
		Иначе
			ТекущиеДанные.ДополнительныеПараметрыОбработки = Неопределено;
			ТекущиеДанные.ПредставлениеНастроекОбработки   = "<Задать параметры>";
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПринадлежностьПредставлениеНастроекОбработкиНачалоВыбора()

// Процедура обработки события "Очистка" колонки ДополнительныеПараметрыОбработки элемента формы Принадлежность.
// Очищает значение поля ДополнительныеПараметрыОбработки.
// Устанавливает значение в поле ПредставлениеНастроекОбработки.
//
Процедура ПринадлежностьПредставлениеНастроекОбработкиОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = ЭлементыФормы.Принадлежность.ТекущиеДанные;
	
	// Если структура парамертров заполнена, запросить подтверждение на очистку
	Если ТекущиеДанные.ДополнительныеПараметрыОбработки.Получить() <> Неопределено Тогда
		
		Ответ = Вопрос(НСтр("ru='Параметры внешней обработки будут очищены. Продолжить?';uk='Параметри зовнішньої обробки будуть очищені. Продовжити?'"), РежимДиалогаВопрос.ДаНет);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			
			ТекущиеДанные.ДополнительныеПараметрыОбработки = Неопределено;
			ТекущиеДанные.ПредставлениеНастроекОбработки   = "<Задать параметры>";
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПринадлежностьПредставлениеНастроекОбработкиОчистка()

// Процедура обработки действия "Подбор" элемента формы КоманднаяПанельОбъектов.
// Открывает форму выбора принадлежности в режиме подбора.
//
Процедура КоманднаяПанельОбъектовПодбор(Кнопка)
	
	ОткрытьФормуВыбораПринадлежности(ЭлементыФормы.Принадлежность, , Истина);
	
КонецПроцедуры //КоманднаяПанельОбъектовПодбор()

// Процедура обработки действия "Очистить" элемента формы КоманднаяПанельОбъектов.
// Очищает табличную часть Принадлежность.
//
Процедура КоманднаяПанельОбъектовОчистить(Кнопка)
	
	Ответ = Вопрос(НСтр("ru='Таблица принадлежности будет очищена. Продолжить?';uk='Таблиця належності буде очищена. Продовжити?'"), РежимДиалогаВопрос.ДаНет);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Принадлежность.Очистить();
	КонецЕсли;
	
КонецПроцедуры // КоманднаяПанельОбъектовОчистить()

Процедура ПослеЗаписи()
	МеханизмНумерацииОбъектов.ОбновитьПодсказкуКодНомерОбъекта(ЭтотОбъект.Метаданные(), ЭлементыФормы.ДействияФормы.Кнопки.Подменю, ЭлементыФормы.Код);
КонецПроцедуры





мСпискиПечатныхФормОбъектов = Новый Соответствие;
